const dataCSS = [
  {
    question: "Різниця між reset.css и normalize.css?",
    answer:
      "Використовувати можна обидва варіанти. reset.css - cкидує стилі елементів, тобто накладаю однорідний стиль для всіх елементів. normalize.css - зберігає корисні стилі браузерів по замовчуванню(тобто узгоджує вигляд між різними браузерами), також може виправляти деякі баги на мобільних та десктопних присторях. ",
  },
  {
    question: "Що таке critical CSS?",
    answer:
      "Це техніка оптимізації завантаження сторінки. Суть такого підходу полягає в тому, що стилі які потребуються для першого рендерінгу, таким чином зменшується час завантаження частини сторінки. Це може бути важливо для першого враження користувача. При такому підході можна користуватись інлайновими стилями(стилі прописуюься одразу в тегові) та вбудованої таблиці стилів(стилі прописуються в head в тегові style type='text/css')",
  },
  {
    question: "Що таке специфічність селекторів в CSS?",
    answer:
      "Специфічність - це спосіб, за допомогою якого браузери визначають, які CSS-властивості найбільше відповідають елементу і як наслідок, будуть застосовані. Тобто якщо є два або більше суперечливих(конфліктуючих) правил CSS, що вказують на один і той самий елемент, браузер слідує деяким правилам. Кожен селектор має своє місце в ієрархії специфічності. Вбудовані стилі мають найбільшу специфічність, ID поступають вбудованим , але переважають інші. На третьому місці будуть класи, атрибути та псевдокласи.Селектор класу переважає будь-яку кількість селекторів елементів. При рівній специфічності - враховується останнє правило. ",
  },
  {
    question: "В чому різниця між псевдокласом та всевдоелементом в CSS?",
    answer:
      "Псевдокласи використовуються для вибору елементів у певному стані або з певними характеристиками, такими як перший, останній, наведений, активний тощо. Псевдоелементи використовуються для стилізації певних частин елементів, які не є окремими HTML-елементами. можна використати для для створення стилів для першого абзацу внутрішнього тексту або вставки вмісту перед або після певного елемента",
  },
  {
    question: "Що таке блочна модель CSS?",
    answer:
      "Блочна модель - це блочний елемент, прямокутний контейнер, незалежно від того, як він візувльно представлений на сторінці. В елемента є область вмісту і необов'язкові поля, відступи та межі(рамка). Content, padding, border, margin.",
  },
  {
    question: "Яку роль виконує box-sizing?",
    answer:
      "Визнає як браузер обчислює обсяг елемента, включаючи його ширину та висоту, а також відступи та границі. Два основних значення: content-box - величина елемента обчислюється на основі висоти контенту в межах границі, розміри падінгів та гнраниць додаються до вказаної ширини та висоти елемента. border-box - величина елемента обчислюється на основі вмісту та включає падінги і границі. Тобто розміри падінгів і границь врахвуються в межах вказаної ширини та висоти елемента. Найчастіше використовується box-sizing: border-box",
  },
  {
    question: "Які є види позиціонування елементів на сторінці?",
    answer:
      "Relative Positioning (Відносне позиціонування): При відносному позиціонуванні, елемент зсувається відносно свого звичайного місця в потоці документа, але залишає відображення простору для нього на своєму оригінальному місці. Це дозволяє використовувати властивості top, right, bottom і left для зміщення елемента відносно його звичайного положення.Absolute Positioning (Абсолютне позиціонування): При абсолютному позиціонуванні, елемент вилучається з потоку документа, і його позиція визначається відносно батьківського елемента, якщо батьківський елемент також має встановлене позиціонування, або відносно вікна перегляду.Fixed Positioning (Фіксоване позиціонування): Елемент з фіксованим позиціонуванням розташовується відносно вікна перегляду і не змінює своє положення при прокручуванні сторінки. Sticky Positioning (Липке позиціонування): Липке позиціонування комбінує властивості відносного і фіксованого позиціонування. Елемент спочатку розташовується відносно вікна, але при прокручуванні сторінки він прилипає до батьківського контейнера або певного позначеного місця.Static Positioning (Статичне позиціонування): Це значення за замовчуванням для позиціонування елементів. Елементи розміщуються в звичайному порядку потоку документа.",
  },
  {
    question: "Що робить властивість z-index?",
    answer:
      "Позиційовані елементи випадають із потоку і для них приміняється z-index, який визначає(контролює) глибину позиціонованих елементів на сторінці по осі z - від очей корристувача і до екрану(перепендикулярно до площини екрану). Має позитивні і негативні значення",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
];

export default dataCSS;
