const dataHTML = [
  {
    question:
      "Що таке DOCTYPE і для чого він потрібен? Що буде, якщо його не вказати?",
    answer:
      "DOCTYPE <!DOCTYPE> - повинен бути першим елементом в html-документі, йде перед тегом <html>. В першу чергу це декларація, а не тег. Тобто інструкція для веб-браузера про те, як інтерпритувати поточну HTML сторінку. Оскільки HTML існує в декількох версіях, крім того, є XHTML (EXtensible HyperText Markup Language, розширена мова розмітки гіпертексту), схожа на HTML, але розрізняється з ним по синтаксису. І щоб браузер правильно інтерпретував вашу сторінку необхідно завжди вказувати, тому що в старіших версіях HTML може перейти в режим сумісності, де він намагатиметься інтерпретувати HTML на основі певних стандартів, які можуть варіюватися залежно від браузера та його версії. Це може призвести до непередбачуваного відображення вашого веб-документа, оскільки різні браузери можуть інтерпретувати код по-різному.. Та якщо не вказати <!DOCTYPE> в HTML5 то браузер все одно буде інтерпретувати документ, в такому випадку, браузер буде використовувати стандартні правила та режим відображеня для HTML5. Але бажано завжди вказувати <!DOCTYPE>. ",
  },
  {
    question: "Для чого потрібні мета-теги?",
    answer:
      "Мета-теги використовуються для зберігання інформації, призначеної для браузера і пошукових систем: встановлення кодування елемента, передача інформації пошуковим системам і багато іншого. Мета тегів може бути кілька, тому що , залежно від використання атрибутів, вони несуть різну інформацію. Необхідно вказувати кодування сторінки для того, щоб браузер коректно відобразив текст. Якщо цього не зробити, або задати не вірне кодування, замість символів браузер може відобразити ієрогліфи - <meta charset=utf-8 /> - найпоширеніше кодування. Короткий опис змісту допомагає пошуковим системам краще проіндексувати сторінку - <meta name=description content=Вивчення основ HTML5 для новачків />. ",
  },
  {
    question: "Чим відрізняється блочний елемент від строчного?",
    answer:
      "Блоковий елемент (block-level element) - займає повністю весь рядок, незалежно від обсягу його контенту, тому кілька блокових елементів візуально йдуть один за одним. Рядковий елемент (inline element) - займає місце по своєму вмісту, тому кілька малих елементів можуть розташуватися на одному рядку. Якщо в рядку не вистачає місця для вміщення рядкового елемента, він переносить на новий рядок.",
  },
  {
    question:
      "Чому деякі символи можуть відображатись на сторінці у виді квадратів?",
    answer: "",
  },
  {
    question: "Що таке семантична верстка? Які семантичні теги знаєте?",
    answer:
      "Семантична розмітка - підхід до створення HTML-розмітки ґрунтується на використанні тегів за їх призначенням відповідно до специфікації і які відповідають типу контенту, що розмічується. Наприклад - <h1> <header> <nav> <main> <img> <p> <a><footer> ",
  },
  { question: "Які типи заголовків існують в HTML?", answer: "" },
  {
    question:
      "Що називається потоком документа в HTML? Чи можна його змінювати?",
    answer:
      "Потік - це вертикальний і горизонтальний порядок послідовного відображення елементів на сторінці. Вертикально потік йде зверху вниз, і , за замовчуванням, елементи відображаються на сторінці в тому порядку, в якому вони вказані в HTML-документі. Горизонтально потік йде зліва направо. Потік можна змінювати за допомогою CSS і JS",
  },
  {
    question:
      "Які існують способи підключення JavaScript до html-сторінки? В чому між ними різниця?",
    answer: "",
  },
  { question: "", answer: "" },
];

export default dataHTML;
