const dataHTML = [
  {
    question:
      "Що таке DOCTYPE і для чого він потрібен? Що буде, якщо його не вказати?",
    answer:
      "DOCTYPE <!DOCTYPE> - повинен бути першим елементом в html-документі, йде перед тегом <html>. В першу чергу це декларація, а не тег. Тобто інструкція для веб-браузера про те, як інтерпритувати поточну HTML сторінку. Оскільки HTML існує в декількох версіях, крім того, є XHTML (EXtensible HyperText Markup Language, розширена мова розмітки гіпертексту), схожа на HTML, але розрізняється з ним по синтаксису. І щоб браузер правильно інтерпретував вашу сторінку необхідно завжди вказувати, тому що в старіших версіях HTML може перейти в режим сумісності, де він намагатиметься інтерпретувати HTML на основі певних стандартів, які можуть варіюватися залежно від браузера та його версії. Це може призвести до непередбачуваного відображення вашого веб-документа, оскільки різні браузери можуть інтерпретувати код по-різному.. Та якщо не вказати <!DOCTYPE> в HTML5 то браузер все одно буде інтерпретувати документ, в такому випадку, браузер буде використовувати стандартні правила та режим відображеня для HTML5. Але бажано завжди вказувати <!DOCTYPE>. ",
  },
  {
    question: "Для чого потрібні мета-теги?",
    answer:
      "Мета-теги використовуються для зберігання інформації, призначеної для браузера і пошукових систем: встановлення кодування елемента, передача інформації пошуковим системам і багато іншого. Мета тегів може бути кілька, тому що , залежно від використання атрибутів, вони несуть різну інформацію. Необхідно вказувати кодування сторінки для того, щоб браузер коректно відобразив текст. Якщо цього не зробити, або задати не вірне кодування, замість символів браузер може відобразити ієрогліфи - <meta charset=utf-8 /> - найпоширеніше кодування. Короткий опис змісту допомагає пошуковим системам краще проіндексувати сторінку - <meta name='description' content='Вивчення основ HTML5'/>. ",
  },
  {
    question: "Чим відрізняється блочний елемент від строчного?",
    answer:
      "Блоковий елемент (block-level element) - займає повністю весь рядок, незалежно від обсягу його контенту, тому кілька блокових елементів візуально йдуть один за одним. Рядковий елемент (inline element) - займає місце по своєму вмісту, тому кілька малих елементів можуть розташуватися на одному рядку. Якщо в рядку не вистачає місця для вміщення рядкового елемента, він переносить на новий рядок.",
  },
  {
    question:
      "Чому деякі символи можуть відображатись на сторінці у виді квадратів?",
    answer:
      "Зазвичай це вказує на проблему з кодуванням символів або використанням непідтримуваних символів. Наприклад неправильне кодування символів, помилка UTF-8. Чи несумісність зі шрифтом. Також можливе використання спеціальних символів, такі як  <, >, &,  і їх треба екранувати за допомогою сутностей HTML  (наприклад, &lt;, &gt;, &amp; відповідно).",
  },
  {
    question: "Що таке семантична верстка? Які семантичні теги знаєте?",
    answer:
      "Семантична розмітка - підхід до створення HTML-розмітки ґрунтується на використанні тегів за їх призначенням відповідно до специфікації і які відповідають типу контенту, що розмічується.Тобто семантична розмітка означає, що теги не вибираються на підставі того, як вони відображаються в браузері - вони вибираються на підставі типу та структури контенту, який розмічується. Наприклад - <h1> <header> <nav> <main> <img> <p> <a><footer> . Також симантичні теги допомагають при читанні сторінок. Ще приклад: <figure> <figcaption> ",
  },
  {
    question: "Які типи заголовків існують в HTML?",
    answer:
      "Заголовки в  HTML - це група тегів <h1> <h2> <h3> <h4> <h5> <h6> - визначає текстові золовки смислових розділів різного рівня, які вказують на важливість секції контенту, розташованого після них. Це інструмент структурування текстового контенту. Тег <h1> прийнято використовувати одни раз на сторінці, як основний заголовок. Решта заголовків можуть використовуватися скільки завгодно разів, та головне дотримуватись ієрархії. Пошукові системи звертають особливу увагу на заголовки, тому коректне використання цієї групи тегів вкрай важливе. Не визначайте рівень заголовка за розміром тексту на макеті. Не весь великий текст - заголовки. Заголовок - це те, що за змістом озаглавлює секцію контенту.",
  },
  {
    question:
      "Що називається потоком документа в HTML? Чи можна його змінювати?",
    answer:
      "Потік - це вертикальний і горизонтальний порядок послідовного відображення елементів на сторінці. Вертикально потік йде зверху вниз, і , за замовчуванням, елементи відображаються на сторінці в тому порядку, в якому вони вказані в HTML-документі. Горизонтально потік йде зліва направо. Потік можна змінювати за допомогою CSS і JS",
  },
  {
    question:
      "Які існують способи підключення JavaScript до html-сторінки? В чому між ними різниця?",
    answer: "",
  },
  {
    question: "Які існують способи додавання CSS на сторінку?",
    answer:
      "CSS (Cascading Style Sheets, каскадні таблиці стилів) - це мова для опису і зміни зовнішнього вигляду елементів. HTML використовується для визначення структури і семантики документу, а CSS - для його оформлення і позиціонування, Стилі можна підключити: вбудовані стилі (inline styles), вбудована таблиця стилів (embedded stylesheet), зовнішня таблиця стилів(external stylesheet). Вбудовані стилі - задаються тегу безпосередньо в атрибут style - їх складно перевизначити або використати повторно, застосовуються в рідких випадках - <p style='color:blue; font-size:24px;'>Цей текст буде синім.</p>. Вбудована таблиця стилів -  CSS-правила додаються всередину тегу <style> в шапці документа. Їх неможливо використовувати повторно на інших сторінках і складно масштабувати і підтримувати. Зовнішня таблиця стилів - Зовнішній CSS-код легко масштабувати, підтримувати і використовувати повторно на інших сторінках, тому це стандарт підключення стилів. У проекті створюється окремий файл стилів з розширенням .css і підключається в HTML-документі. Підключається CSS-код в head <link rel='stylesheet' href='./css/styles.css' />",
  },
];

export default dataHTML;
