const dataCSS = [
  {
    question: "Різниця між reset.css и normalize.css?",
    answer:
      "Використовувати можна обидва варіанти. reset.css - cкидує стилі елементів, тобто накладаю однорідний стиль для всіх елементів. normalize.css - зберігає корисні стилі браузерів по замовчуванню(тобто узгоджує вигляд між різними браузерами), також може виправляти деякі баги на мобільних та десктопних присторях. ",
  },
  {
    question: "Що таке critical CSS?",
    answer:
      "Це техніка оптимізації завантаження сторінки. Суть такого підходу полягає в тому, що стилі які потребуються для першого рендерінгу, таким чином зменшується час завантаження частини сторінки. Це може бути важливо для першого враження користувача. При такому підході можна користуватись інлайновими стилями(стилі прописуюься одразу в тегові) та вбудованої таблиці стилів(стилі прописуються в head в тегові style type='text/css')",
  },
  {
    question: "Що таке специфічність селекторів в CSS?",
    answer:
      "Специфічність - це спосіб, за допомогою якого браузери визначають, які CSS-властивості найбільше відповідають елементу і як наслідок, будуть застосовані. Тобто якщо є два або більше суперечливих(конфліктуючих) правил CSS, що вказують на один і той самий елемент, браузер слідує деяким правилам. Кожен селектор має своє місце в ієрархії специфічності. Вбудовані стилі мають найбільшу специфічність, ID поступають вбудованим , але переважають інші. На третьому місці будуть класи, атрибути та псевдокласи.Селектор класу переважає будь-яку кількість селекторів елементів. При рівній специфічності - враховується останнє правило. ",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
  {
    question: "",
    answer: "",
  },
];

export default dataCSS;
